import { describe, it } from "vitest"


describe("AlertModal Component", () => {
  it("버튼 클릭시 해당 ModalName을 가진 모달이 열린다.", () => {

  })

  it("모달이 열리면 해당 모달의 내용이 보여진다.", () => {

  })

  it("모달이 열리면 해당 모달의 버튼이 보여진다.", () => {

  })

  it("미리 지정한 버튼의 텍스트가 보여진다.", () => {

  })

  it("미리 props로 넘겨준 버튼의 기능이 동작한다.", () => {

  })

  it("취소하기(부정어) 버튼을 누르면 모달창이 닫힌다.", () => {

  })

  it("미리 지정한 ModalName을 가진 모달이 열린 상태에서 다른 ModalName을 가진 모달을 열면 이전 모달은 닫힌다.", () => {

  })

  it("미리 지정한 ModalName을 가진 모달이 열린 상태에서 다른 ModalName을 가진 모달을 열면 새로운 ModalName을 가진 모달이 열린다.", () => {

  })

  it("모달에 X버튼을 제외한 다른 버튼이 나타나지 않는다.", () => {

  })

  it("모달에 X버튼을 누르면 모달이 닫힌다.", () => {

  })
})